read_verilog HDL.v
synth
flatten
opt
write_json netlist.json