read_verilog HDL.v
hierarchy -check -top NandGate
synth
flatten
opt
write_json netlist.json